skill_dictionary = {
    "猛烈撞击": '95 a',
    "寄生种子": '90 e00j',
    "叫声": '00 d00AD1-',
    "藤之鞭": '00 a',
    "毒雾": '75 e00p',
    "催眠粉": '75 e00s',
    "突进": '85 r1/4',
    "飞叶刀": '95 c2',
    "甜蜜香气": '00 d00ER1-',
    "魔法增效": '00 b00AP1',
    "莽撞": '00 r1/3',
    "清醒": '00 e00w5~5-', 
    "光合作用": '00 h1/2',
    "种子炸弹": '00 a',
    "花瓣群舞": '00 a', # TODO 连续攻击2-3回合，最后回合自身混乱
    "阳光烈焰": '00 e00n-', 

    "爆击枪": '00 a e10b',
    "抓挠": '00 a',
    "烟雾弥漫": '00 d00AR1-',
    "暗黑诅咒": '00 d00SP1-',
    "火之刃": '95 e20b', # TODO 20%让对手烧伤或恐惧
    "龙之爪牙": '00 f40',
    "切裂之刀": '00 c2',
    "火焰漩涡": '70 e00b',
    "飞翅连击": '00 a',
    "火焰喷发": '00 e10b',
    "热力爆弹": '95 e10b',
    "烈焰冲锋": '00 r1/3 e10b',
    "火烧眉毛": '00 a e00w3~6-',

    "钢贝壳": '00 b00DF1',
    "尾巴挠痒": '00 d00DF1-',
    "气泡术": '00 a d20SP1-',
    "超声攻击": '55 e00c', 
    "水之神枪": '00 a',
    "狂咬": '00 a e30f', # TODO 30%让对手恐惧
    "挣脱": '00 ', # TODO 解除自身束缚
    "护盾术": '00 ', # TODO 保护自己本回合不受到伤害，但是连续使用可能失败。先手+3
    "水之波纹": '00 e20c',
    "水打击": '90 a',
    "头槌爆": '00 e00n- b00DF1', # TODO 本回合提高自身防御1级，下回合攻击
    "祭祀之雨": '80 a',
    "光栅炮": '00 d20MD1-',
    "水波术": '80 a',
    "川流不息": '00 a e00d-', # TODO 免疫睡眠3-6回合
}
